Revit 2024 API
FamilyElementVisibility.IsShownInCoarse Property
Indicates if the instance is display with Coarse detail level in the view of project document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsShownInCoarse { get; set; }
Visual Basic
Public Property IsShownInCoarse As Boolean
	Get
	Set
Visual C++
public:
property bool IsShownInCoarse {
	bool get ();
	void set (bool value);
}
Remarks
This property cannot be set to false if the other two detail levels are also false.
See Also
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace